     **free
       dcl-s num1   zoned(7:2);
       dcl-s num2   zoned(7:2);
       dcl-s result zoned(7:2);
       num1=32564.6;
       num2=34545.67;
       result = num1 + num2;
       dsply result;
       return;
       *Inlr = *On;
