**FREE
dcl-s NAME VARCHAR(25) iNZ('ARPIT VERMA');
dcl-s dept varchar(15) inz('IBMi');
dcl-s working char(10) inz('Intern');
dcl-s experience zoned(2) ;
experience= 00;
dsply NAME;
dsply dept;
dsply working;
dsply experience;
return ;
*Inlr = *ON;
