     **free
       DCL-F empdtl2 Disk  usage(*output) keyed;
       empid = 112;
       empname = 'Ajay Singh';
       empSalary = 34000;
       empdept = 'Cobol';
       write empdtlr;
       *inlr = *On;
