     D       string1   S             20A
     C                   eval      string1='HelloWorld'
     C     'HEY RPG'     DSPLY
     C                   return
