     DNUM1             S              5S 0 INZ(3456)
     DNUM2             S              6S 0 INZ(5678)
     DSUM              S              6S 0
     DPRODUCT          S             10S 0
     C     NUM1          MULT      NUM2          PRODUCT                45
     C                   RESET                   PRODUCT                34
     C                   EVAL      *INLR = *ON
